import { Accordion } from "@radix-ui/react-accordion";
import QuestionsCard from "./QuestionsCard";

const QuestionsData = [
  {
    id: "1",
    title: "قولنامه آنلاین خودرو چیست؟",
    details: "قولنامه آنلاین خودرو یک سند الکترونیکی است که شرایط و توافقات بین خریدار و فروشنده خودرو را به صورت آنلاین ثبت و تضمین می‌کند.",
  },
  {
    id: "2",
    title: "چگونه می‌توانم قولنامه آنلاین بنویسم؟",
    details: "برای نوشتن قولنامه آنلاین، به سامانه ثبت لاین مراجعه کرده و اطلاعات مربوط به خودرو، خریدار و فروشنده را وارد کنید. سپس مراحل تایید و امضای الکترونیکی را دنبال کنید.",
  },
  {
    id: "3",
    title: "سامانه رسمی معاملات آنلاین خودرو چیست؟",
    details: "سامانه رسمی معاملات آنلاین ثبت لاین اولین پلتفرم تایید شده توسط مراجع ضیصلاح است که فرآیند خرید و فروش خودرو را به صورت آنلاین و امن انجام می‌دهد.",
  },
  {
    id: "4",
    title: "سامانه معاملات خودرو چگونه کار می‌کند؟",
    details: "سامانه معاملات خودرو با ورود اطلاعات خودرو، تایید صحت آن‌ها، و ثبت و امضای قرارداد به صورت آنلاین، فرآیند معامله را ساده و امن می‌کند.",
  },
  {
    id: "5",
    title: "مبایعه نامه آنلاین چیست؟",
    details: "مبایعه نامه آنلاین یک سند دیجیتال است که شرایط فروش و انتقال مالکیت خودرو را بین خریدار و فروشنده ثبت و تایید می‌کند.",
  },
  {
    id: "6",
    title: "چگونه به وبسایت رسمی معاملات آنلاین ثبت لاین دسترسی پیدا کنم؟",
    details: "برای دسترسی به وبسایت رسمی معاملات آنلاین ثبت لاین، کافیست به آدرس اینترنتی ما مراجعه کنید و مراحل ثبت نام و معامله را آغاز کنید.",
  },
  {
    id: "7",
    title: "سامانه رسمی نقل و انتقال خودرو چگونه کار می‌کند؟",
    details: "سامانه رسمی نقل و انتقال خودرو با ثبت اطلاعات خودرو و طرفین معامله، تایید آن‌ها و صدور مبایعه نامه الکترونیکی، فرآیند انتقال مالکیت را آنلاین و امن می‌کند.",
  },
  {
    id: "8",
    title: "برگ سبز آنلاین چیست؟",
    details: "برگ سبز آنلاین یک سند الکترونیکی است که اطلاعات مالکیت و وضعیت حقوقی خودرو را به صورت دیجیتال ثبت و تایید می‌کند.",
  },
  {
    id: "9",
    title: "مبایعه نامه الکترونیکی چه مزایایی دارد؟",
    details: "مبایعه نامه الکترونیکی با افزایش شفافیت، کاهش جعل و تسریع فرآیند معامله، امنیت و کارایی بیشتری را برای خریداران و فروشندگان خودرو فراهم می‌کند.",
  },
  {
    id: "10",
    title: "تاریخچه پلاک آنلاین چیست؟",
    details: "تاریخچه پلاک آنلاین اطلاعات کامل و دقیقی از سوابق و نقل و انتقالات پلاک خودرو را به صورت دیجیتال ارائه می‌دهد.",
  },
  {
    id: "11",
    title: "چگونه می‌توانم استعلام سابقه پلاک آنلاین بگیرم؟",
    details: "برای استعلام سابقه پلاک آنلاین، به سامانه ثبت لاین مراجعه کرده و با وارد کردن شماره پلاک، اطلاعات کامل سوابق پلاک را دریافت کنید.",
  },
];

const QuestionsSection = () => {
  return (
    <div className="flex flex-col items-center gap-10 w-full py-10 mt-32 max-md:mt-10 max-w-7xl mx-auto px-5">
      <h4 className="text-3xl text-center text-bold self-start text-gray-800 dark:text-white">سوال های پر تکرار کاربران</h4>
      <Accordion type="single" collapsible className=" my-4 w-full space-y-4">
        {QuestionsData.map((item) => {
          return <QuestionsCard key={item.id} title={item.title} details={item.details} id={item.id} />;
        })}
      </Accordion>
    </div>
  );
};
export default QuestionsSection;
